Repository: mohamedabdelaziz55/news_task
Catalog: lib/l10n/app_*.arb
Languages: ar

source: News
ar: أخبار

source: App
ar: التطبيق

source: {category} News
ar: أخبار {category}

source: Article bookmarked ✅
ar: تم حفظ المقال ✅

# bookmarkFailed
source: Failed to bookmark ❗
ar: فشل في الحفظ ❗

source: Categories
ar: الفئات

# noCategories
source: No categories saved.
ar: لم يتم حفظ أي فئات.

source: Latest bookmarks
ar: أحدث المحفوظات

# noBookmarks
source: No bookmarks yet. 😕
ar: لا توجد عناصر محفوظة بعد 😕

# somethingWrong
source: Something went wrong
ar: حدث خطأ ما

# newsDetailTitle
source: News Detail
ar: تفاصيل الخبر

# bookmarkSuccess
source: Article bookmarked ✅
ar: تم حفظ المقال ✅

# bookmarkFail
source: Failed to bookmark ❗
ar: فشل في حفظ المقال ❗

# searchHint
source: Search by title or content
ar: ابحث بعنوان أو المحتوى

# searchResultsTitle
source: Results
ar: النتائج

# searchNoResults
source: No results found
ar: لا توجد نتائج

# searchUnknownSource
source: Unknown
ar: غير معروف

# searchNoTitle
source: No title
ar: لا يوجد عنوان

# splashAppTitle
source: News App
ar: تطبيق الأخبار

# splashAppBy
source: By: Mohamed Elsafty
ar: بواسطة: محمد الصفطي

source: News Categories
ar: فئات الأخبار

# techTitle
source: Tech Innovations Today
ar: ابتكارات التكنولوجيا

# businessTitle
source: Business News Today
ar: أخبار الأعمال اليوم

# entertainmentTitle
source: Top Entertainment Stories
ar: أهم أخبار الترفيه

# generalTitle
source: General Headlines
ar: العناوين العامة

# healthTitle
source: Health Tips & Advice
ar: نصائح صحية ومعلومات

# scienceTitle
source: Latest Scientific Research
ar: أحدث الأبحاث العلمية

# sportsTitle
source: Sports Highlights
ar: أهم أحداث الرياضة

source: Setting
ar: اعدادات
